##  <br>FEATURE ENCODING </br>

<p style='font-size:18px'> <b>Used in the categorical non numerical data </b></p>

<b> Types of the categorical data</b>
* Nominal data:It has no inherent order
    - One hot endcoding is done for the nominal data
* Ordinal data
    - Ordinal Encoding is done for the ordinal data
    - label Encoding is done for the output labels

### 1. Ordinal Encoding

In [77]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [78]:
df=pd.read_csv('Student_performance_10k.csv')

In [79]:
df.sample(5)

,roll_no,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,science_score,total_score,grade
6203,std-6204,female,group C,bachelor's degree,0.0,1.0,73,75.0,88.0,99.0,335.0,A
6572,std-6573,female,group C,some college,1.0,0.0,69,38.0,47.0,79.0,233.0,C
3202,std-3203,male,group C,some college,1.0,1.0,42,46.0,89.0,73.0,250.0,B
7620,std-7621,female,group E,bachelor's degree,1.0,1.0,69,70.0,85.0,35.0,259.0,B
6323,std-6324,female,group B,high school,1.0,0.0,70,96.0,73.0,59.0,298.0,B

In [80]:
df.describe()

,lunch,test_preparation_course,reading_score,writing_score,science_score,total_score
count,9976.000000,9977.000000,9975.000000,9976.000000,9977.000000,9981.000000
mean,0.644246,0.388694,70.125915,71.415798,66.063045,264.740908
std,0.478765,0.487478,19.026245,18.245360,19.324331,42.304858
min,0.000000,0.000000,17.000000,10.000000,9.000000,89.000000
25%,0.000000,0.000000,57.000000,59.000000,53.000000,237.000000
50%,1.000000,0.000000,71.000000,72.500000,67.000000,268.000000
75%,1.000000,1.000000,85.000000,85.000000,81.000000,294.000000
max,1.000000,1.000000,100.000000,100.000000,100.000000,383.000000

In [81]:
df['race_ethnicity'].unique()

array(['group D', 'group B', 'group C', 'group E', 'group A', 'A', nan,
       'C', 'D', 'group C\\n', 'B', 'E'], dtype=object)

In [82]:
map_values = {
    'C': 'group C',
    'group C': 'group C',
    'group C\n': 'group C',  # Note single backslash for actual newline
    'A': 'group A',
    'E': 'group E',
    'D': 'group D',
    'B': 'group B',
    'group A':'group A',
    'group B':'group B',
    'group C':'group C',
    'group D':'group D',
    'group E':'group E'
}
df['race_ethnicity'] = df['race_ethnicity'].map(map_values)

In [83]:
df['race_ethnicity']

0       group D
1       group B
2       group C
3       group D
4       group C
         ...
9995    group C
9996    group C
9997    group B
9998    group B
9999    group B
Name: race_ethnicity, Length: 10000, dtype: object

In [84]:
df['race_ethnicity'].unique()

array(['group D', 'group B', 'group C', 'group E', 'group A', nan],
      dtype=object)

In [85]:
df.isnull().sum()

roll_no                         1
gender                         18
race_ethnicity                 27
parental_level_of_education    22
lunch                          24
test_preparation_course        23
math_score                     24
reading_score                  25
writing_score                  24
science_score                  23
total_score                    19
grade                           3
dtype: int64

In [86]:
df.dropna(axis=0,inplace=True,subset=['race_ethnicity','lunch','gender','roll_no','test_preparation_course','parental_level_of_education'])

In [87]:
df.isnull().sum()

roll_no                         0
gender                          0
race_ethnicity                  0
parental_level_of_education     0
lunch                           0
test_preparation_course         0
math_score                     23
reading_score                  24
writing_score                  24
science_score                  23
total_score                    19
grade                           3
dtype: int64

In [88]:
df.describe()

,lunch,test_preparation_course,reading_score,writing_score,science_score,total_score
count,9888.000000,9888.000000,9864.000000,9864.000000,9865.000000,9869.000000
mean,0.644013,0.389159,70.120742,71.410483,66.052205,264.769480
std,0.478836,0.487584,19.028816,18.233380,19.320498,42.304509
min,0.000000,0.000000,17.000000,10.000000,9.000000,89.000000
25%,0.000000,0.000000,57.000000,59.000000,53.000000,237.000000
50%,1.000000,0.000000,71.000000,73.000000,67.000000,268.000000
75%,1.000000,1.000000,85.000000,85.000000,81.000000,295.000000
max,1.000000,1.000000,100.000000,100.000000,100.000000,383.000000